IDEA Open Model
WeldData Properties
Compatible with IDEA StatiCa v 10.1
The WeldData type exposes the following members.
Properties
Name | Description
ConnectedPartIds
 Id of the weld
End
 End of the weld
Id
 Id of the weld
Material
 Name of the material
Name
 Name of the weld
Start
 Start of the weld
Thickness
 Thickness of the weld
WeldType
 Type of the weld
Top
See Also
Reference
WeldData Class
IdeaRS.OpenModel.Connection Namespace